In [2]:
import pymysql

#### creating our connection object

In [3]:
db = pymysql.connect("localhost","root","Prince009#",database="schooldb")

In [4]:
cursor = db.cursor()

In [5]:
type(db)

pymysql.connections.Connection

In [6]:
cursor

##### executing a query and get the results

In [7]:
cursor.execute('show tables;')
cursor.fetchall()

(('course',), ('enrolls_in',), ('student',))

In [8]:
cursor.execute('show tables;')
cursor.fetchone()

('course',)

In [9]:
cursor.execute('show databases;')
cursor.fetchall()

(('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('portfolio',),
 ('schooldb',),
 ('sys',))

In [10]:
query = """
SELECT * 
FROM course
"""
cursor.execute(query)
cursor.fetchall()

(('c1', 'Data analytics', 1127),
 ('c2', 'Python', 303),
 ('c3', 'corp fin', 331),
 ('c4', 'prod. mgmt', 1127),
 ('c5', 'Ethics', 303),
 ('c6', 'leadership', 303),
 ('c7', 'bus analytics', 1127))

In [11]:
query = """
SELECT * 
FROM enrolls_in;
"""
cursor.execute(query)
cursor.fetchall()

(('111-22-3333', 'c1', 93.0),
 ('111-22-3333', 'c2', 95.0),
 ('123-12-1234', 'c1', 87.0),
 ('222-33-4455', 'c3', 44.0),
 ('555-11-7777', 'c1', 36.0))

In [12]:
query = """
SELECT * 
FROM Student; 
"""
cursor.execute(query)
cursor.fetchall()

(('111-22-3333', 'JOHN', 'CHILDS', '6461231212', 'New York', '10025'),
 ('123-12-1234', 'Mary', 'Arias', None, 'New York', '10011'),
 ('222-33-4455', 'Lila', 'Pennington', '4251231212', 'Seattle', '98105'),
 ('555-11-7777', 'Roberto', 'Perez', '9173335479', 'San Francisco', '94110'))

In [13]:
query = """
SELECT course.name,enrolls_in.score
FROM Student
INNER JOIN enrolls_in ON Student.ssn = enrolls_in.ssn
INNER JOIN course ON course.number = enrolls_in.class
WHERE f_name = "JOHN";
"""
cursor.execute(query)
result = cursor.fetchall()

In [14]:
for thing in result:
    print(thing[0], thing[1], sep='\t')

Data analytics	93.0
Python	95.0

In [15]:
query = 'INSERT INTO student VALUES ("678-33-2345","Bing","Crossby","2346789870","New York","10001");'
cursor.execute(query)

1

In [16]:
query = 'SELECT * FROM student'
cursor.execute(query)
result = cursor.fetchall()

In [17]:
result

(('111-22-3333', 'JOHN', 'CHILDS', '6461231212', 'New York', '10025'),
 ('123-12-1234', 'Mary', 'Arias', None, 'New York', '10011'),
 ('222-33-4455', 'Lila', 'Pennington', '4251231212', 'Seattle', '98105'),
 ('555-11-7777', 'Roberto', 'Perez', '9173335479', 'San Francisco', '94110'),
 ('678-33-2345', 'Bing', 'Crossby', '2346789870', 'New York', '10001'))

In [19]:
for thing in result:
    print(thing[4])

New York
New York
Seattle
San Francisco
New York